[
  {
    "Name": "Foundation Medical Bio -Chemistry ( MBChB -ECP 1)",
    "Code": "MFBC010",
    "Description": "MFBC 010 is designed to give students a firm grounding in basic chemistry, with an emphasis on understanding \nbodily processes in humans which are of a chemical nature. The module has two secti ons, general chemistry and \norganic chemistry and biochemistry  \n General chemistry  \nIn general chemistry you are expected to understand the use of the SI system of measurement, Distinguish between and to compare elements, compounds and mixtures. Understand the importance and the use of the \nperiodic table. Describe the types of radiation produced during radioactive decay. Explain the formation of ions \nand of ionic bonds. Name ionic compounds covalent bonding and name covalent compounds. Also included in the \ncourse content are chemical reactions, gases, solutions, acids and bases.  \n \nOrganic chemistry and Biochemistry  \nDraw structures for and name various alkanes, alkenes and alkynes.  Indicate sources, properties and uses of \nhydrocarbons, alcohols, ethers, thiols , haloalkanes, aldehydes, ketones, carboxylic acids, esters, amides, amines.  \nClassify carbohydrates, Lipids and proteins. Properties of carbohydrates, Lipids and proteins",
    "Assessment": "four Semester tests (1 and 1/2 hour) and 1 x 3 -hours written paper fin al examination"
  },
  {
    "Name": "Foundation Introduction to the Human Body (MBChB -ECP 1)",
    "Code": "MFHB010",
    "Description": "Foundation Medical Biology (MBChB -ECP 1)  MFMB010   \n The Foundation Medical Biology (MBChB -ECP 1) syllabus is designed to provide broad competence for careers \nthat inv olve the biology of animals, plants in relation to their environment including human medicine.  \n \nModule content: The module will introduce the student to the field of Microbiology, Taxonomy, Genetics, Ecology, \nDiabetes, Environmental science and Anatomy.  \n \nBasic Microbiological aspects that will be covered include introduction into the diversity of the microbial world \n(bacteria, archaea, eukaryotic microorganisms and viruses), basic principles of cell structure and function, \nmicrobial nutrition and microbial  growth and growth control. Applications in Microbiology will be illustrated by \nspecific examples i.e. bioremediation, animal -microbial symbiosis, plant -microbial symbiosis and the use of \nmicroorganisms in industrial microbiology. Wastewater treatment, mic robial diseases and food will be introduced \nusing specific examples.  \n \nWhile Genetics will be covered include chromosomes and cell division. Principles of Mendelian inheritance: locus \nand alleles, dominance interactions and epistasis. Probability studies, s ex determination and sex linked traits, \npedigree analysis, extra nuclear inheritance, genetic linkage, chromosome mapping and chromosome variation will also be covered. Basic human reproductive organs aspects will include reproductive health and human \nwelfare, implantation and placental physiology in pregnancy, placental secretions and their regulation.  Basic \nunderstanding of diabetes pathophysiology, diabetes biology, diabetes prevention and diabetes therapy will be covered. Discussion about various psycho social aspects of type 1 and type 2 diabetes will be done.  \n \nMoreover, understanding of relationships between different organisms to one another and to their physical surroundings will be covered under Ecology. Environmental science that will be covered inc lude public awareness \nof environment issues, role of Government, NGO’s, environmental movements, natural resources, effect of human activities, depletion of resources, generation of waste, threats to biodiversity, extinction of species and sustainable \ndeve lopment.  Understand the scientific study of the physiology, structure, distribution, classification, and \nimportance of plants will also be covered.  \n \nLastly, this module will cover process of science which consists of scientific method where by the collect ion of \ndata through observation and experimentation, and the formulation and testing of hypotheses will be done.  \n The teaching program comprises of one formal lecture per week (40 minutes) and one tutorial session (80 \nminutes) and 2 hour practical session  a week.",
    "Assessment": "Four formative assessment semester (tests) (1hr: 30 mins); one practical assessment (1 hour) and 1 \nx 3-hours written paper summative assessment (final examination). Admission to write the summative \nassessment depends on compliance wi th General rule 13.1.   \n  \nMedical Foundation of Study Skills (MBChB -ECP 1)   MFSS010"
  },
  {
    "Name": "Advanced Microbiology (BSc Hons (MS)",
    "Code": "MMMB080",
    "Description": "This course is an extension of the basics in medical microbiology with an in depth focus on specific pathogenic \norganisms. Focus w ill be on the pathogenesis, laboratory investigation and prevention/vaccine development and \nantimicrobial resistance mechanisms.",
    "Assessment": "2 written papers, and an oral assessment with an external examiner  \n \nAdvanced Virology (BSc Hons (MS)       (MMVB08 0) \n This course is an extension of the basics in medical microbiology with an in depth focus on specific pathogenic \norganisms. Consists of lectures, tutorials and student seminars, as well as assignments covering the study in \nrelative detail of selected t opics in Medical Virology. Topics include viral replication, cell transformation & tumour \nviruses, viral evolution, immunology of infectious diseases pathogenesis, laboratory diagnosis and analysis, \nepidemiology, prevention and treatment), basic vaccinolog y and vaccine development, viral hepatitis, viral \ngastrointestinal diseases, HIV/AIDS and human papillomaviruses."
  },
  {
    "Name": "Anatomy  (B Rad I)",
    "Code": "MANB010",
    "Description": "This course is similar to that of Anatomy (Nursing).  It entails the teaching of system atic human anatomy and \nsurface anatomy for all relevant structures with emphasis on those sections of specific radiological importance.   \nThis is done by means of problem –based lectures, traditional lectures, practicals, demonstrations and tutorials \nusing human material as well as radiographic images.  Evaluation is done by means of written theory tests, \npracticals and assignments.   \nThe same exemption rule as for MBChB II is applied.",
    "Assessment": "1 x 3 -hours written paper"
  },
  {
    "Name": "Biology I (BSc(Med) I; MBChB I)",
    "Code": "BLGY105",
    "Description": "Introduction; evolution; taxonomy and systematics; cytology and genetics; tissues and systems; embryology; medically important parasites; medically important carriers; medically important poisonou s/venomous animals; \nmedically important plants; ecology and environmental health.  \nPractical.",
    "Assessment": "2 x 2 -hours written papers  \nTotal course Credits:  20 \n \nBiology II  \n \nAdvanced cytology -  plant and animal cells, fine structure and function of cell o rganelles. Invertebrates; \nsystematics and life cycle of selected groups with special reference to structure and function.  Botany; systematics and life cycle of selected groups; plant structure and function as well as plant physiology and reproduction.  Th e \nteaching programme comprises five formal lectures and two 3 -hour practicals per week.   \n Assessment: 1 written paper  \n \nBiology III  \n \nVertebrates; systematics and life cycle of selected groups; fine structure and function; comparative morphology.  \nGenetics  and reproduction.  Animal physiology; adaptations to various environments by both vertebrates and \ninvertebrates.  General ecology.  Evolution.  The teaching programme comprises five formal lectures and two 3 -\nhours practicals per week.   \n Assessment:  1 wri tten paper"
  },
  {
    "Name": "Biophysics IA (MBChB I)",
    "Code": "MBPC 010",
    "Description": "Mechanics: Mathematical Concepts, Kinematics in 1 and 2 dimensions, Forces and Newton’s Laws, Dynamics of \ncircular/rotational motions, Work and energy, Impulse and momentum.  \nFluids, Heat and Proper ties of matter: Elasticity, Fluids, Temperature and Heat, Transfer of Heat, Ideal gas law \nand Kinetic theory, Thermodynamics  \nWaves, sound and optics: Waves and sound, Reflection of light, Refraction of light.  \nElectricity and Magnetism: Electric Forces and Electric fields, Electric potential energy and Electric Potential, \nElectric Circuits, Magnetic Forces and Magnetic Fields, Electromagnetic induction.  \nModern Physics: Nuclear Physics and Radioactivity, Ionising Radiation.  \nIntroduction to Health Informatics:  Introduction to elementary statistics, Introduction to Computer Fundamentals.  \nThe teaching programme comprises of three formal lectures per week, one three hour practical and one three \nhour tutorial every alternating week.",
    "Assessment": "1 x 3 -hours writte n paper"
  },
  {
    "Name": "Biophysics IB - B Rad (Diagn) I",
    "Code": "MBPA010",
    "Description": "Mathematics review; vectors; kinematics; dynamics; hydrostatics; fluid flow; general gas law; heat; optics; \nelectrostatics; current electricity; electro magnetism; alternating current; radioact ivity; x- rays.  The teaching \nprogram comprises five formal lectures per week and one 3 -hour practical every alternative week.",
    "Assessment": "1 x 3 -hours written paper  \nTotal course Credits:  24"
  },
  {
    "Name": "Biophysics IIB  (Equipment) B Rad(Diagn) II",
    "Code": "MBPA020",
    "Description": "Review of electricity: current, voltage, resistance, DC, AC transformers, capacitor, mains voltage, three phase \nsupply, power.  Basic electronics: diodes, transistors, SCR, operational amplifier, digital systems, and computer.  \nX-ray equipment; mains s upply; x -ray tubes; x -ray tables and tubestands; high tension control circuits and \nstabilising equipment; transformers; exposure switching and exposure timers; circuit protection; meters; circuit \ndiagrams; mobile portable and conventional dental units; con trol of scattered radiation; care and maintenance of \nequipment.",
    "Assessment": "1 x 3 -hours written paper"
  },
  {
    "Name": "Biophysics IIC (Radiation Physics) B Rad (Diagn) II",
    "Code": "MBPB020",
    "Description": "Matter and energy; atomic structure; nuclear structure; radiation and spectra ; electromagnetic radiation; \nradioactivity; production of x -rays; interaction of x -rays with matter; effects of x -rays; measurement of x -ray \nquantity; dosimetry; filters and filtration; radiation quality; properties of x -ray film; radiographic image; radia tion \nprotection.",
    "Assessment": "1 x 3 -hours written paper"
  },
  {
    "Name": "Chemical Pathology (MBChB IV)",
    "Code": "MCAA040",
    "Description": "Introductory, including methodological and physiological interferences in laboratory tests.  The kidneys; sodium \nand water metabolism; potassium metabolism; hydrogen ion  homeostasis and blood gases; pituitary and gonads; \nhormones of the adrenal cortex; thyroid hormones; carbohydrates; plasma lipids; calcium; phosphorus and \nmagnesium metabolism; intestinal absorption; gastric and pancreatic function; liver diseases and gal lstones; \nplasma proteins and immunoglobulins; proteinuria; plasma enzymes; cardiac biomarkers; inborn errors of \nmetabolism; purine and uric acid metabolism; iron metabolism; porphyrins; vitamins; pregnancy and oral \ncontraceptives; biochemical effects of tu mours; cerebrospinal fluid.",
    "Assessment": "1 written paper and an oral"
  },
  {
    "Name": "Chemistry IA ( MBChB I)",
    "Code": "MCHM010",
    "Description": "Introduction to general chemistry; atoms, ions, and molecules; chemical laws; bonding; stoichiometry; the three \nstates  of aggregation; solutions and mixtures; structure and reactivity; principles of equilibrium; free energy and \nspontaneity of reactions; electrochemistry; rates of reactions; radioactivity; stereoisomerism; systematic \nnomenclature of organic compounds accor ding to functional groups; reactions of classes of organic compounds; \nchemistry of physiologically important compounds.   \n  \n3 lectures and 1 practical per week",
    "Assessment": "1 x 3 hours written papers"
  },
  {
    "Name": "Clinical Pharmacology    (MBChB IV)",
    "Code": "MPYA040)",
    "Description": "Disease orientated, clinical pharmacology, based on prevalence of disease in the local and national communities \n(Pharmaco -epidemiology) .  Alternative and cost -effective medication.  Special precautions. Contents:  General \naspects, drugs used for: infections , respiratory, cardiovascular, gastro -intestinal, genito -urinary, central nervous \nsystem, haematological, dermatological ophthalmological, otorhinolaryngological, endocrine, metabolic, immune \nsystem and Musculoskeletal disorders.  Drugs used for sexually t ransmitted diseases, parasitic infections and \nacute poisoning. Rational use of medicines. Evidence based Pharmacology.  \n Assessment:  Tests",
    "Assessment": "1 x 2 hours written paper and oral where applicable  \n \nClinical Psychology for MSc  \n \nAdvanced course in ps ychodiagnostics; medical and neuropsychology; psychopathology; personality theory; \npsychotherapy and development psychology.  Practical work as well as an internship at an institution recognised \nfor this purpose by the Health Professions Council of South A frica.  \n \nCommunication Science: Capita selecta  (Environmental Health)  \n \nPractical and theoretical training in communication skills in the private and public sectors at all levels of \ngovernment or management.  Pedagogic skills.  Methods of Health Education.   \n A series of lectures as set out per topic below.   \nAnatomical Pathology (40 lectures), Internal Medicine (40 lectures), Pharmacology (20 lectures.)"
  },
  {
    "Name": "Community Health (MBChB IV)",
    "Code": "MPBA040",
    "Description": "Basic ecology, Basic biostatistics, demography and epid emiologic theory.  The epidemiology and intervention of \nthe important health related conditions of Southern Africa.  Environmental health and occupational health.  The \nstructure and functions of health delivery organisations in South Africa.  Basic health legislation.  Basic health \nmanagement strategies.  Students may be required to perform their own approved study project.",
    "Assessment": "1 written paper"
  },
  {
    "Name": "Forensic Medicine (MBChB IV)",
    "Code": "MFPA040",
    "Description": "Signs of death, post morte m changes and time of death; identification of human remains; blood stains and \ngrouping; types of wounds and injuries; fire arm wounds; injury by blunt instruments; effects of injury; asphyxia; \nsuspicious neonatal death; abortion; sexual offences; the medi co legal autopsy; legal considerations.  Toxicology:  \nGeneral facts, Carbon Monoxide, Cyanide, Arsenic, Paraffin, Methyl Alcohol, Agricultural Poisons.",
    "Assessment": "1 written paper and an oral  \n \nHealth Administration: Capita selecta (BSc) (Med) (Hons) (En vironment"
  },
  {
    "Name": "Human Physiology",
    "Code": "MPIB022 will include:",
    "Description": "Advanced knowledge of all physiological systems (including excitable tissues, the cardiovascular system, bold \nand immunity,  the gastrointestinal system, endocrinology, body temperature, reproduction, neurophysiology, \nspecial senses, respiration, renal physiology, body fluids, acid base) and physiological chemistry and application \nof this in clinical scenarios and the mechanism s involved in the development of pathological conditions",
    "Assessment": "2 written papers –  1 for each module"
  },
  {
    "Name": "Human Sciences (MBChB I)",
    "Code": "MHUC010",
    "Description": "Foundations of Psychology, Learning Theories, Personality, Emotion, Motivation and Stress, Ps ychophysiology, \nSocial Psychology, Interpersonal Skills",
    "Assessment": "1 written paper  \nTotal course Credits:   12"
  },
  {
    "Name": "Image Recording I (B Rad (Diagn) I)",
    "Code": "MIMR010",
    "Description": "Principles of photography, image receptor systems, chemical processing of photographi c materials, radiographic \nimage quality, identification and presentation, exposure charts",
    "Assessment": "1 written paper, a practical/ an oral/ OSCE"
  },
  {
    "Name": "Image Recording II (B Rad (Diagn) II)",
    "Code": "MRAA020",
    "Description": "Sensitometry, intesnsifying screens; computed r adiography; conventional fluoroscopy, daylight systems, \nspecialised photographic procedures; radiographic image quality; exposure factors, silver recovery and \nconservation.",
    "Assessment": "1 written paper, a practical and an oral"
  },
  {
    "Name": "Medical Microbiology (MBChB III)",
    "Code": "MMMA030",
    "Description": "This course includes: Introduction to bacteria, viruses, fungi, parasites and pathogenesis of infections; Microbial \ngenetics; Basic and clinical immunology; laboratory diagnosis;  infection prevention and control; clinical virology; \nantimicrobial agents and the following syndromes: Central nervous system infections; cardiovascular system \ninfections; gastrointestinal tract infections; skin and soft tissue infections; genitourinary t ract infections, neonatal \nand childhood infections and zoonotic & vector borne (multisystem) infections.",
    "Assessment": "Exam comprises of paper 1 and paper 2 (practical component) together with an oral for the \nborderline students."
  },
  {
    "Name": "Pathology and Anatomy (B Rad III)",
    "Code": "MPAA030",
    "Description": "Module I  - General Pathology  \nCell damage; inflammation; healing and hypertrophy; the immune response; immunopathology, disturbances of circulation.  Misce llaneous degeneration and deposits; tumours, origin, nature and causation; epithelial and other \ntumours.  Instruction: 32 x 40 -min periods.  \n \nModule II  - Systemic Pathology  \nCardiovascular system; respiratory system; nervous system; reproductive system, male  and female; gastro -\nintestinal system; liver biliary tract and exocrine pancreas; urinary system; musculo -skeletal system; endocrine \nsystem; blood and bone marrow; lymph reticular system.",
    "Assessment": "1 x 3 -hours paper and an oral/ Computer -based exam  \n \nPersonnel Management A & B (BSc) (Med) (Hons) (Enviro nmental Health)  \n A course over two years aimed at the management and administration of Environmental Health Services in the \npublic and private sectors based on general principles."
  },
  {
    "Name": "Pharmacology (Basic) (MBChB III)",
    "Code": "PHAR107",
    "Description": "This introductory co urse in Pharmacology covers medicines (drugs) affecting various systems in the human body.  \nThe therapeutic and adverse effects of drugs on the following systems are included: autonomic nervous -, central \nnervous -, cardiovascular -, respiratory - and endocrin e system.  Chemotherapeutic drugs as well as the \npharmacokinetics and pharmacodynamics of medicines are also included in the range of this course.  \nFormal lectures: 4 lectures per week",
    "Assessment": "3 written tests and 1 written examination"
  },
  {
    "Name": "Pathology and Anatomy (B Rad III)",
    "Code": "MPAA030",
    "Description": "Module I  - General Pathology  \nCell damage; inflammation; healing and hypertrop hy; the immune response; immunopathology, disturbances of \ncirculation.  Miscellaneous degeneration and deposits; tumours, origin, nature and causation; epithelial and other \ntumours.  Instruction: 32 x 40 -min periods.  \n \nModule II  - Systemic Pathology  \nCardiov ascular system; respiratory system; nervous system; reproductive system, male and female; gastro -\nintestinal system; liver biliary tract and exocrine pancreas; urinary system; musculo -skeletal system; endocrine \nsystem; blood and bone marrow; lymphoreticular  system.",
    "Assessment": "1 x 3 -hours paper and an ora l \n \nPersonnel Management A & B (BSc) (Med) (Hons) (Environmental Health)  \n A course over two years aimed at the management and administration of Environmental Health Services in the \npublic and private sectors based on general principles."
  },
  {
    "Name": "Pharmacology (Basi c) (MBChB III)",
    "Code": "PHAR107",
    "Description": "This introductory course in Pharmacology covers medicines (drugs) affecting various systems in the human body.  \nThe therapeutic and adverse effects of drugs on the following systems are included: autonomic nervous -, cent ral \nnervous -, cardiovascular -, respiratory - and endocrine system.  Chemotherapeutic drugs as well as the \npharmacokinetics and pharmacodynamics of medicines are also included in the range of this course.  \nFormal lectures: 4 lectures per week",
    "Assessment": "3 w ritten tests and 1 written examination"
  },
  {
    "Name": "Practice of Medicine V",
    "Code": "MPOA050",
    "Description": "This course is offered at MBChB V level and will offer the students practical experience and theoretical \nunderstanding in Anaesthesiology, Ophthalmology, Otorhinolaryngology and Orthopaedics.  Pathophysiology and \nPathology within the wider context of integrated medicine will be offered as Case and Task based learning, \nfocussing on the them es of Substance Abuse, Thyroid disease, Heartburn with Epigastric Pain and the Severely \nTraumatised Patient.  The student will be expected to continue with portfolio building.  \n  \n Psychiatry  Courses (MBChB III, IV and VI)  \n \n(i) MBChB III and IV  \n Medical psyc hology, offered in the MBChB III course by the Department of Clinical Psychology, serves \nas an introduction to Psychopathology, offered by the Department of Psychiatry, in the MBChB IV \ncourse.  These two courses include the following topics:  Personality st ress in health and \nillness; Psychosomatic disorders and pain; Clinical Psychology and Medicine ions  \n \n(ii) MBChB V and VI  \n In the MBChB V and VI year courses the students do clinical psychiatry working in the wards and outpatient clinics. They also have te aching sessions in form of tutorials, and participate in case \npresentations. Attendance at all the activities is a prerequisite for the End of Block assessment. \nEvaluation is done in accordance with their case presentations, written examination and clinica l \nexamination.  \n \nPsychology and Mental Health Care  \n \nPhysiological basis of psychology: the human personality; motivation of conduct; frustration and conflict; defence mechanisms; emotion; attitudes; group morale, leadership; communication; human relations;  the child; the \nadolescent; the adult and the aged person as a patient.  Mental health care, psychosomatic and \npsychopathological conditions; broad concept of the management of patients with mental disturbances in \nhospitals and the community.  Theoretical instruction: 60 x 40 -minute periods.  \n \nHuman Science (MBChB)                           (MHUC01)  \n Introduction to Psychology: basic concepts, schools in Psychology and methodology.  The biological basis of \nbehaviour.  Motivation, frustration and conflicts.  Developmental Psychology: infancy to old age.  Personality",
    "Assessment": "1 written paper"
  },
  {
    "Name": "Radiation Techniques I (B Rad (Diagn) I)",
    "Code": "MRAT010",
    "Description": "Patient and the radiographer, administration -hospital and department organisation, practical nursing procedures, \nfirst aid, general patient care, hygiene in X -ray department, sterilisation, drugs in the X -ray department.  Radiation \nhazard, fun damentals of diagnostic radiography, radiographic Assessments and techniques: skeletal system, \nabdomen, respiratory system, Introduction to radiation protection",
    "Assessment": "1 written paper and OSCE"
  },
  {
    "Name": "Radiation Techniques III (B Rad (Diagn) III)",
    "Code": "MRAB030",
    "Description": "Computed Tomography Clinical applications, Biliary system; Genito -urinary system; Reproductive system, Cardio -\nvascular system; lymphatic system; respir atory system; central nervous system; Athrography; Myelography; \nguided biopsies; Risk management, Ethics and Professionalism, Special contrast media in radiology; operating \ntheatre procedures; ward radiography; paediatric radiography; soft tissue different iation; Ultrasound; Computed  \n Tomography; Magnetic Resonance Imaging; Bone Densitometry, Introduction to Mammography, Dental \nradiography",
    "Assessment": "1 written paper and OSCE"
  }
]